9/data/attachments/688ac0c62c80044d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shirley_end_Friend_56579_5</nif:username>
            <nif:friendToBeRequested>soap_friends_9a7ccd03-c2bd-49fd-8296-74a569e46d08</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>